README2.md
```mermaid
erDiagram

    dim_date {
        int date_sur_id PK
        date date
        int year
        int month
        int day
        int weekday
        string weekday_name
        boolean is_weekend
    }

    dim_flight {
        string flight_sur_id PK
        string flight_no
        date date
        time time
        string origin
        string destination
        string line_id
        string source
    }

    dim_product {
        string product_sur_id PK
        string item_id
        string status
        string item_category
        boolean is_food
        string item_type
    }

    dim_session {
        string session_sur_id PK
        string session_id
        boolean is_offline_mode
    }

    dim_card {
        string card_sur_key PK
        string card_number_prefix
        string card_type
        string brand
        string issuer
        string country
    }

    dim_load {
        string load_sur_id PK
        string line_id
        string load_id
    }

    fact_sales {
        string sales_sur_id PK
        string flight_key FK
        string session_key FK
        string product_key FK
        string slip_id
        string sales_type
        float price
        int sold_quantity
        float purchase_amount
        float discount_amount
        int date_key FK
    }

    fact_payment {
        string payment_sur_id PK
        string flight_key FK
        string session_key FK
        string card_key FK
        string slip_id
        string payment_type
        float purchase_amount
        int date_key FK
    }

    fact_pax {
        string pax_sur_id PK
        string flight_key FK
        string class
        int pax_quantity
        int date_key FK
    }

    fact_wastage {
        string wastage_sur_id PK
        string flight_key FK
        string item_key FK
        int load_quantity
        int sold_quantity
        int wastage_quantity
        int fresh_wastage_quantity
        int date_key FK
    }

    dim_flight ||--o{ fact_sales
    dim_flight ||--o{ fact_payment
    dim_flight ||--o{ fact_pax
    dim_flight ||--o{ fact_wastage

    dim_product ||--o{ fact_sales
    dim_product ||--o{ fact_wastage

    dim_session ||--o{ fact_sales
    dim_session ||--o{ fact_payment

    dim_card ||--o{ fact_payment

    dim_date ||--o{ fact_sales
    dim_date ||--o{ fact_payment
    dim_date ||--o{ fact_pax
    dim_date ||--o{ fact_wastage
```
