README2.md
```mermaid
flowchart LR

    fact_sales --> mart_sales_performance
    fact_sales --> mart_product_sales
    fact_sales --> mart_flight_sales

    fact_pax --> mart_flight_sales

    dim_product --> mart_product_sales
    dim_flight --> mart_flight_sales
    dim_date --> mart_sales_performance
```
